Revit 2027 API
BuiltInFailures.EditingFailures.CannotMoveHereInViewError Property
 Can't move here at this view angle. Set another Work Plane or adjust the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveHereInViewError { get; }
Public Shared ReadOnly Property CannotMoveHereInViewError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveHereInViewError {
	FailureDefinitionId^ get ();
}
static member CannotMoveHereInViewError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace